04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/moodyChart/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInitial        0.01;

dimensions      [turbulentKineticEnergy];

internalField   uniform $kInitial;

boundaryField
{
    wall
    {
        type            kqRWallFunction;
        value           uniform $kInitial;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
