04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/moodyChart/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInitial    1.0;

dimensions      [turbulentOmega];

internalField   uniform $omegaInitial;

boundaryField
{
    wall
    {
        type            omegaWallFunction;
        value           uniform $omegaInitial;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
